# Sequence-ის მაგალითი
name = "Nika"          # 1. ვანიჭებთ სახელს ცვლადს
age = 16              # 2. ვანიჭებთ ასაკს ცვლადს
print(name)           # 3. ვბეჭდავთ სახელს
print(age)            # 4. ვბეჭდავთ ასაკს



# Iteration-ის მაგალითი
for i in range(5):           # ვიმეორებთ კოდს 5-ჯერ (i იღებს მნიშვნელობას 0-დან 4-მდე)
    print("Hello", i)        # თითოეულ წრეში ბეჭდავს Hello-ს და ციფრს



# Selection-ის მაგალითი
age = 18
if age >= 18:                 # თუ პირობა სიმართლეა
    print("Adult")            # შესრულდება ეს ხაზიც
else:
    print("Minor")            # თუ პირობა არ არის სიმართლე, შესრულდება ეს



# Sequence ნიშნავს კოდში ინსტრუქციების შესრულებას თანმიმდევრობით, ერთის შემდეგ ერთი. პროგრამა ინსტრუქციებს ასრულებს ზუსტად იმ რიგით, როგორც დაწერილია.


 
# Iteration არის პროცესი, როცა კოდი მეორდება ერთსა და იმავე ან განსხვავებულ მონაცემებზე. Python  iteration ხშირად გამოიყენება "for" ან "while" -  ით



# Selection ნიშნავს კოდის გარკვეული ნაწილის შესრულებას კონკრეტული პირობის შემთხვევაში. Python-ში ეს ხდება if, elif, else-ის საშუალებით





