wona = int(input("შეიყვანე წონა >>> "))
age = int(input("შეიყვანე ასაკი >>> "))

if age < 10 and wona < 20:
    print("წონა დაბალია")
elif 20 <= wona <= 40:
    print("წონა ნორმალურია")
elif wona > 40:
    print("წონა მაღალია")
else:
    print("მონაცემები არ შეესაბამება არცერთ კატეგორიას")



# თუ ასაკი < 10:

# წონა < 20 → "წონა დაბალია"

# წონა 20-40 → "წონა ნორმალურია"

# წონა > 40 → "წონა მაღალია"

# თუ ასაკი 10-17:

# წონა < 40 → "წონა დაბალია"

# წონა 40-65 → "წონა ნორმალურია"

# წონა > 65 → "წონა მაღალია"

# თუ ასაკი 18 ან მეტი:

# წონა < 50 → "წონა დაბალია"

# წონა 50-90 → "წონა ნორმალურია"

# წონა > 90 → "წონა მაღალია"
